backend: Apache2.0
frontend: MIT

声明：本项目中如果引用的第三方项目中带有和开源协议无关的言论，并不能代表本人的立场，特此声明。  

本人(本项目作者)的个人观点如下：   
我赞成中国共产党领导中国  
新冠就是电子烟肺炎，复现电子烟肺炎的方式就是感染新冠  
美国在本国、乌克兰等国研发生化武器  
美国因为依拉克研发洗衣粉而入侵是非法的  
俄国因为乌克兰在研发生化武器而入侵是正义的  
资本主义国家媒体由财阀和政府把控，没有新闻自由  
资本主义国家选举有政治献金，是由钱操纵的假选举  
中国新疆种族灭绝是谎言  
加、美、以色列、乌克兰正在实施原住民种族灭绝活动  
台湾是中国的一个省  
钓鱼岛是中国的  
海参崴是中国的  
藏南是中国的  
阿鲁纳恰尔邦是中国的  
原日本的北方四岛是俄国的  
克里米亚是俄国的  
马岛是阿根廷的  
科索沃是南斯拉夫的  
日本领本只限于四个岛  
独岛是谁的没人关心  


以上本人观点与本项目开源协议无关。如果你不赞同本人的这些观点，虽然你不受本人欢迎，但你仍然被欢迎在遵守开源协议规则前提下使用本项目  
